Repository: SnehaRaut03/plant_pdd
Catalog: disease_detection/locale/*/LC_MESSAGES/django.po
Languages: ne

source: Plant Disease Recognition
ne: वनस्पति रोग पहिचान

source: Plant Disease Recognition System
ne: वनस्पति रोग पहिचान प्रणाली

source: Language
ne: भाषा

source: Manage Users
ne: प्रयोगकर्ता व्यवस्थापन

source: Home
ne: होम

source: Profile
ne: प्रोफाइल

source: History
ne: इतिहास

source: Logout
ne: लगआउट

source: Detection History
ne: पहिचान इतिहास

source: Total Users
ne: कुल प्रयोगकर्ताहरू

source: Total Detections
ne: कुल पहिचानहरू

source: Username
ne: प्रयोगकर्ता नाम

source: Email
ne: इमेल

source: Join Date
ne: सदस्यता मिति

source: Last Login
ne: अन्तिम लगइन

source: Detections
ne: पहिचानहरू

source: Actions
ne: कार्यहरू

source: User Profile
ne: प्रयोगकर्ता प्रोफाइल

source: Date Joined
ne: सदस्यता मिति

source: Role
ne: भूमिका

source: Administrator
ne: प्रशासक

source: Regular User
ne: सामान्य प्रयोगकर्ता

source: Leaf Image
ne: पात छवि

source: Detected on:
ne: पहिचान गरिएको मिति:

source: Download Report
ne: रिपोर्ट डाउनलोड गर्नुहोस्

source: Are you sure you want to delete this item?
ne: के तपाईं यो आइटम मेटाउन निश्चित हुनुहुन्छ?

source: Delete
ne: मेटाउनुहोस्

source: You haven't made any detections yet.
ne: तपाईंले अहिलेसम्म कुनै पहिचान गर्नुभएको छैन।

source: Plant Disease Detection
ne: वनस्पति रोग पहिचान

source: Select leaf image:
ne: पातको छवि चयन गर्नुहोस्:

source: Drag & drop an image here or click to browse
ne: यहाँ छवि तान्नुहोस् र छोड्नुहोस् वा ब्राउज गर्न क्लिक गर्नुहोस्

source: Supported formats: JPG, PNG, JPEG
ne: समर्थित ढाँचा: JPG, PNG, JPEG

source: Image Preview
ne: छवि पूर्वावलोकन

source: Sneha
ne: वनस्पति रोग पहिचान प्रणाली

source: Analyze Image
ne: छवि विश्लेषण गर्नुहोस्

source: Show Treatment
ne: उपचार देखाउनुहोस्

source: Analyzing image... Please wait
ne: छवि विश्लेषण गर्दै... कृपया पर्खनुहोस्

source: Detection Results
ne: पहिचानका परिणाम

source: Treatment Recommendation
ne: उपचार सिफारिस

source: Plant Growing Requirements
ne: वनस्पति वृद्धि आवश्यकताहरू

source: Optimal Temperature:
ne: अनुकूल तापमान:

source: Our AI-powered system analyzes plant leaf images to detect diseases and provide treatment recommendations. Upload a clear image of a plant leaf to get instant results. This system is trained to recognize diseases in specific plants such as apple, tomato, grape, potato, and more, offering accurate diagnosis and tailored treatment advice.
ne: हाम्रो एआई-सञ्चालित प्रणालीले बिरुवाको पातको तस्बिरहरू विश्लेषण गरेर रोगहरू पत्ता लगाउने र उपचार सिफारिसहरू प्रदान गर्ने काम गर्छ। तुरुन्त परिणामहरू प्राप्त गर्न एक स्पष्ट पातको तस्बिर अपलोड गर्नुहोस्। यो प्रणाली विशेष रूपमा स्याउ, टमाटर, आलु लगायतका विभिन्न बिरुवाहरूका लागि डिजाइन गरिएको हो, जसले ती बिरुवामा हुने विशेष रोगहरू पहिचान गरी उपयुक्त समाधानहरू सुझाव दिन्छ।

source: Temperature:
ne: तापमान:

source: Sunlight Requirements:
ne: सूर्यको प्रकाश आवश्यकताहरू:

source: Watering Requirements:
ne: पानीको आवश्यकताहरू:

source: Humidity:
ne: आर्द्रता

source: Download PDF Report
ne: PDF रिपोर्ट डाउनलोड गर्नुहोस्

source: Weather in
ne: मौसम

source: Feels like:
ne: महसुस हुने तापमान

source: Wind:
ne: हावा

source: No treatment found for this disease.
ne: यस रोगको लागि कुनै उपचार फेला परेन।

source: Error fetching data:
ne: डाटा ल्याउन त्रुटि:

source: Yield Prediction
ne: हाम्रो पूर्वानुमान

source: Calculating yield prediction...
ne: उपज पूर्वानुमान गणना गर्दै...

source: Enter Location:
ne: स्थान प्रविष्ट गर्नुहोस्

source: Calculate Yield Prediction
ne: उपज पूर्वानुमान गणना गर्नुहोस्

source: Current Conditions
ne: हालको अवस्था

source: Location:
ne: कार्यहरू

source: Temperature
ne: अनुकूल तापमान:

source: Weather:
ne: मौसम

source: Plant Requirements
ne: वनस्पति वृद्धि आवश्यकताहरू

source: Sunlight:
ne: सूर्यको प्रकाश

source: Watering:
ne: पानी दिनु

source: Recommendations
ne: उपचार सिफारिस

source: Show Yield Prediction
ne: हाम्रो पूर्वानुमान

source: Apple___Apple_scab
ne: स्याउ___स्याउको खप्टे रोग

source: Apply copper-based fungicides or fungicides containing captan or mancozeb during the early stages of infection. Remove infected leaves and fallen debris to prevent reinfection. Ensure proper air circulation by pruning infected parts of the tree.
ne: संक्रमणको प्रारम्भिक चरणमा तामाजन्य (कपर-आधारित) फफूंदी नाशक वा क्याप्टान वा म्यानकोजेब भएको फफूंदी नाशक प्रयोग गर्नुहोस्। पुनःसंक्रमण रोक्नका लागि संक्रमित पातहरू र खसेका फोहोरहरू हटाउनुहोस्। रूखको संक्रमित भागहरू काटछाँट गरेर उचित हावापास सुनिश्चित गर्नुहोस्।

source: Apple___Black_rot
ne: स्याउ___कालो कुहिने रोग

source: Remove infected branches and leaves immediately. Apply fungicides such as captan, copper-based treatments, or mancozeb to protect healthy tissue. Practice good orchard hygiene and ensure proper spacing for better airflow.
ne: संक्रमित हाँगाहरू र पातहरू तुरुन्तै हटाउनुहोस्। स्वस्थ भागको संरक्षण गर्न क्याप्टान, तामा आधारित उपचारहरू, वा म्यानकोजेबजस्ता फफूंदी नाशकहरू प्रयोग गर्नुहोस्। बगैंचामा राम्रो सरसफाइ अभ्यास गर्नुहोस् र राम्रो हावापासका लागि उचित दूरी कायम गर्नुहोस्।

source: Apple___Cedar_apple_rust
ne: स्याउ___सीडर स्याउ रस्ट

source: Use fungicides like captan and mancozeb to control the infection. Remove infected leaves and prune surrounding cedar trees to reduce rust spread. Regularly inspect your trees and maintain good orchard hygiene.
ne: संक्रमण नियन्त्रण गर्न क्याप्टान र म्यानकोजेबजस्ता फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पातहरू हटाउनुहोस् र रस्ट फैलिन नदिन वरपरका सिडर रूखहरू काटछाँट गर्नुहोस्। तपाईंका रूखहरू नियमित रूपमा निरीक्षण गर्नुहोस् र बगैंचामा राम्रो सरसफाइ कायम राख्नुहोस्।

source: Apple___healthy
ne: स्याउ___स्वस्थ

source: Ensure the plant receives adequate water, sunlight, and proper soil nutrition. Mulch around the base of the tree to retain moisture and suppress weeds. Regularly check for pests and prune dead or infected leaves to maintain overall plant health.
ne: बोटले पर्याप्त पानी, घाम, र उचित माटोको पोषण प्राप्त गरिरहेको सुनिश्चित गर्नुहोस्। रूखको जरा वरिपरि मल्च हालेर नमी जोगाउन र झार दबाउन सहयोग गर्नुहोस्। कीराहरूको नियमित रूपमा जाँच गर्नुहोस् र सुकेका वा संक्रमित पातहरू काटछाँट गरेर बोटको समग्र स्वास्थ्य कायम राख्नुहोस्।

source: Blueberry___healthy
ne: ब्लुबेरी___स्वस्थ

source: Maintain slightly acidic, well-drained soil for healthy blueberry plants. Water regularly but avoid waterlogging to prevent root rot. Apply organic mulch around the base of the plant to retain moisture and control weeds.
ne: स्वस्थ ब्लुबेरी बोटका लागि अलिकति अम्लीय र राम्रोसँग निकास भएको माटो कायम राख्नुहोस्। नियमित रूपमा पानी हाल्नुहोस् तर जराहरू कुहिने खतरा कम गर्न पानी जम्न नदिनुहोस्। बोटको आधार वरिपरि जैविक मल्च प्रयोग गरेर नमी जोगाउनुहोस् र झार नियन्त्रण गर्नुहोस्।

source: Cherry_(including_sour)___Powdery_mildew
ne: चेरी (खट्टा चेरी समेत)___पाउडरी फफूंदी

source: Apply sulfur-based fungicides or neem oil to control powdery mildew. Remove infected leaves and debris to prevent the spread of spores. Prune the tree to allow better airflow and reduce fungal infections.
ne: पाउडरी फफूंदी नियन्त्रण गर्न गन्धक-आधारित फफूंदी नाशक वा निमको तेल प्रयोग गर्नुहोस्। स्पोर्सहरू फैलिन नदिन संक्रमित पातहरू र फोहोर हटाउनुहोस्। राम्रो हावापासको लागि रूखको काटछाँट गर्नुहोस् र फफूंदीजन्य संक्रमण घटाउनुहोस्।

source: Cherry_(including_sour)___healthy
ne: चेरी (खट्टा चेरी समेत)___स्वस्थ

source: Ensure adequate water, sunlight, and proper soil drainage for healthy cherry trees. Prune dead wood and remove fallen leaves to reduce pest and disease risks. Fertilize with balanced nutrients to support growth and fruiting.
ne: स्वस्थ चेरी रूखका लागि पर्याप्त पानी, घाम, र उचित माटो निकास सुनिश्चित गर्नुहोस्। सुकाएका हाँगाहरू काट्नुहोस् र खसेका पातहरू टाउनुहोस् जसले किरा र रोगको जोखिम घटाउँछ। बोटको वृद्धि र फल लाग्न सहयोग गर्न सन्तुलित पोषक तत्वयुक्त मल प्रयोग गर्नुहोस्।

source: Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot
ne: मकै___सर्सपोरा पातको दाग ग्रे पात दाग

source: Apply fungicides containing azoxystrobin or chlorothalonil to prevent further infection. Rotate crops annually to reduce pathogen buildup. Remove infected leaves and dispose of them properly to limit disease spread.
ne: थप संक्रमण रोक्नको लागि अजोक्सिस्ट्रोबिन वा क्लोरोथालोनिल भएको फफूंदी नाशक प्रयोग गर्नुहोस्। रोगजन्य जीवाणुको संचित असर घटाउन बाली हरेक वर्ष परिवर्तन (रोटेसन) गर्नुहोस्। संक्रमित पातहरू हटाएर सही तरिकाले नष्ट गर्नुहोस् ताकि रोग नफैलियोस्।

source: Corn_(maize)__Common_rust
ne: मकै___सामान्य रस्ट

source: Use resistant corn varieties and apply fungicides like azoxystrobin or propiconazole during early growth. Ensure proper crop rotation to reduce pathogen buildup. Remove infected plants and debris after harvest to reduce future risks.
ne: रोग प्रतिरोधी मकैको जातहरू प्रयोग गर्नुहोस् र वृद्धि प्रारम्भिक चरणमा अजोक्सिस्ट्रोबिन वा प्रोपीकोनाजोलजस्ता फफूंदी नाशक प्रयोग गर्नुहोस्। रोगजनक घटाउन बाली फेर्ने अभ्यास गर्नुहोस्। रोगको भविष्यको जोखिम कम गर्न कटनीपछि संक्रमित बोट र फोहोर हटाउनुहोस्।

source: Corn_(maize)___Northern_Leaf_Blight
ne: मकै___उत्तरी पात झुल

source: Apply fungicides like chlorothalonil during early growth stages. Rotate crops and remove infected plant parts to reduce disease spread. Ensure proper soil drainage and avoid planting maize in the same location every year.
ne: प्रारम्भिक वृद्धि चरणमा क्लोरोथालोनिलजस्ता फफूंदी नाशक प्रयोग गर्नुहोस्। बाली फेर्नुहोस् र संक्रमित भागहरू हटाउनुहोस् ताकि रोग फैलन नदिइयोस्। राम्रो माटोको निकास सुनिश्चित गर्नुहोस् र हरेक वर्ष एउटै ठाउँमा मकै नरोप्नुहोस्।

source: Corn_(maize)___healthy
ne: मकै___स्वस्थ

source: Ensure consistent watering, especially during flowering, and provide adequate nitrogen. Plant corn in well-drained, loamy soil with proper spacing for airflow. Control weeds and pests that may compete for nutrients.
ne: फूल फुल्ने समयमा विशेष ध्यान दिँदै नियमित पानी दिनुहोस् र पर्याप्त नाइट्रोजन प्रदान गर्नुहोस्। मकैलाई राम्रोसँग निकास भएको दोमट माटोमा रोप्नुहोस् र हावापासको लागि उचित दूरी राख्नुहोस्। पोषणको प्रतिस्पर्धा गर्ने झारपात र कीराहरू नियन्त्रण गर्नुहोस्।

source: Grape___Black_rot
ne: अंगुर___कालो कुहिने रोग

source: Apply copper-based fungicides during the growing season to control black rot. Prune and remove any infected leaves and vines. Ensure proper airflow by spacing vines properly and consider using resistant grape varieties.
ne: ब्ल्याक रट नियन्त्रण गर्न बृद्धि अवधिमा तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पात र लत्तर हटाउनुहोस्। उचित दूरीमा लत्तर रोपेर हावापास सुनिश्चित गर्नुहोस् र रोग प्रतिरोधी अंगुरको जातहरू प्रयोग गर्न विचार गर्नुहोस्।

source: Grape___Esca_(Black_Measles)
ne: अंगुर___एस्का (कालो खैरापन)

source: Prune infected vines and apply sulfur or copper-based fungicides. Ensure proper vineyard hygiene by removing infected wood and treating with appropriate fungicides. Control vine pests that may spread the disease and maintain good soil health.
ne: संक्रमित लत्तरहरू काट्नुहोस् र गन्धक वा तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित काठ हटाएर उपयुक्त फफूंदी नाशक प्रयोग गरेर राम्रो बगैंचा सरसफाइ कायम गर्नुहोस्। रोग फैलाउने लत्तर किरा नियन्त्रण गर्नुहोस् र माटोको स्वास्थ्य राम्रो राख्नुहोस्।

source: Grape___Leaf_blight_(Isariopsis_Leaf_Spot)
ne: अंगुर___पातको झुल (इसारियोप्सिस पात दाग)

source: Apply fungicides like mancozeb to control leaf blight. Remove infected leaves and ensure proper spacing for better airflow. Avoid overhead irrigation, which can spread fungal spores.
ne: पात झुल नियन्त्रण गर्न म्यानकोजेबजस्ता फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पात हटाउनुहोस् र हावापासका लागि उचित दूरी कायम गर्नुहोस्। फफूंदी फैलन नदिन माथिबाट पानी हाल्ने विधि टार्नुहोस्।

source: Grape___healthy
ne: अंगुर___स्वस्थ

source: Regularly prune vines, ensure good drainage, and maintain proper spacing. Water regularly but avoid over-watering and check for pests and diseases. Ensure that vines receive adequate sunlight for healthy growth.
ne: नियमित रूपमा लत्तर काट्नुहोस्, राम्रो निकास सुनिश्चित गर्नुहोस्, र उचित दूरी कायम राख्नुहोस्। नियमित रूपमा पानी दिनुहोस् तर अत्यधिक पानी नदिनुहोस्, र कीरा तथा रोगको जाँच गर्नुहोस्। स्वस्थ वृद्धि लागि पर्याप्त घाम सुनिश्चित गर्नुहोस्।

source: Orange___Haunglongbing_(Citrus_greening)
ne: सुन्तला___ह्वाङलुङबिङ (साइट्रस हरियो रोग)

source: Remove infected trees immediately to prevent the disease from spreading. Apply insecticides to control the citrus psyllid, which transmits the disease. Regularly inspect trees for early signs of infection and practice strict sanitation.
ne: रोग फैलिन नदिन संक्रमित रूख तुरुन्त हटाउनुहोस्। रोग सार्ने सिट्रस सायलिड नियन्त्रण गर्न कीटनाशक प्रयोग गर्नुहोस्। संक्रमणको प्रारम्भिक लक्षणको लागि नियमित रूपमा रूखको निरीक्षण गर्नुहोस् र कडाइका साथ सरसफाइ अभ्यास गर्नुहोस्।

source: Peach___Bacterial_spot
ne: आरु___ब्याक्टेरियल दाग

source: Remove infected branches and apply copper-based fungicides. Avoid overhead irrigation, as it spreads bacteria. Use resistant peach varieties and practice crop rotation to minimize the spread of bacterial pathogens.
ne: संक्रमित हाँगाहरू हटाउनुहोस् र तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। माथिबाट पानी हाल्न नदिनुहोस् किनकि यसले ब्याक्टेरिया फैलाउँछ। रोग प्रतिरोधी आरु जातहरू प्रयोग गर्नुहोस् र बाली फेर्ने अभ्यास गर्नुहोस्।

source: Peach___healthy
ne: आरु___स्वस्थ

source: Water regularly, provide adequate sunlight, and maintain well-drained soil. Prune dead wood and maintain organic mulch to retain moisture and suppress weeds. Fertilize with balanced nutrients to encourage strong growth and fruit production.
ne: नियमित रूपमा पानी दिनुहोस्, पर्याप्त घाम सुनिश्चित गर्नुहोस्, र राम्रो निकास भएको माटो प्रयोग गर्नुहोस्। सुकाएका हाँगाहरू काट्नुहोस् र नमी जोगाउन तथा झार दबाउन जैविक मल्च प्रयोग गर्नुहोस्। सन्तुलित पोषक तत्वयुक्त मल प्रयोग गरेर राम्रो वृद्धि र फलफूल सुनिश्चित गर्नुहोस्।

source: Pepper,_bell___Bacterial_spot
ne: खुर्सानी (ठूलो)___ब्याक्टेरियल दाग

source: Remove infected plants and apply bactericides like copper-based products. Avoid overhead watering as it can spread the bacteria. Rotate crops to prevent the buildup of bacterial pathogens in the soil.
ne: संक्रमित बोट हटाउनुहोस् र तामाजन्य उत्पादनजस्ता ब्याक्टेरिसाइड प्रयोग गर्नुहोस्। माथिबाट पानी हाल्नु हुँदैन किनभने यसले ब्याक्टेरिया फैलाउँछ। माटोमा ब्याक्टेरियाको सङ्कलन रोक्न बाली फेर्ने अभ्यास गर्नुहोस्।

source: Pepper,_bell___healthy
ne: खुर्सानी (ठूलो)___स्वस्थ

source: Water bell peppers regularly, especially during flowering. Ensure they receive organic fertilizers and mulch to retain moisture. Check for pests and diseases and remove any affected plants immediately.
ne: फूल फुल्ने बेला विशेष ध्यान दिएर नियमित रूपमा पानी दिनुहोस्। जैविक मल प्रयोग गर्नुहोस् र नमी जोगाउन मल्च हाल्नुहोस्। कीरा तथा रोगहरूको जाँच गर्नुहोस् र संक्रमित बोटहरू तुरुन्त हटाउनुहोस्।

source: Potato___Early_blight
ne: आलु___पहिलो झुल

source: Apply fungicides like chlorothalonil to control early blight. Remove infected leaves and avoid overhead irrigation. Practice crop rotation and ensure good soil drainage to prevent future outbreaks.
ne: अर्ली ब्लाइट नियन्त्रण गर्न क्लोरोथालोनिलजस्ता फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पातहरू हटाउनुहोस् र माथिबाट पानी हाल्न नदिनुहोस्। बाली फेर्ने अभ्यास गर्नुहोस् र राम्रो माटो निकास सुनिश्चित गर्नुहोस्।

source: Potato___Late_blight
ne: आलु___ढिलो झुल

source: Apply fungicides during wet weather to prevent late blight. Remove infected leaves and stems and dispose of them away from the field. Rotate crops and avoid over-watering to reduce the humidity that promotes blight.
ne: विलम्ब ब्लाइट नियन्त्रण गर्न ओसिलो मौसममा फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पात र हाँगाहरू हटाएर खेतबाट बाहिर नष्ट गर्नुहोस्। बाली फेर्नुहोस् र अत्यधिक पानी नदिनुहोस् ताकि रोग फैलाउने ओस घटोस्।

source: Potato___healthy
ne: आलु___स्वस्थ

source: Ensure potatoes are planted in well-drained soil with adequate sunlight. Water regularly, especially during dry periods, and apply balanced fertilizers. Mulch around the plants to retain moisture and reduce weed competition.
ne: आलुहरू राम्रोसँग निकास भएको माटोमा, पर्याप्त घाम लाग्ने ठाउँमा रोप्नुहोस्। सुख्खा मौसममा विशेष गरी नियमित रूपमा पानी दिनुहोस् र सन्तुलित मल प्रयोग गर्नुहोस्। नमी जोगाउन र झार घटाउन बोट वरिपरि मल्च प्रयोग गर्नुहोस्।

source: Raspberry___healthy
ne: रास्पबेरी___स्वस्थ

source: Raspberries require slightly acidic, well-drained soil and regular watering. Prune dead or damaged canes to encourage healthy new growth. Mulch around the base to retain moisture and prevent weed growth.
ne: रास्पबेरीका लागि अलिकति अम्लीय र राम्रो निकास भएको माटो आवश्यक हुन्छ। नियमित पानी दिनुहोस्। मरेका वा बिग्रिएका टुसाहरू काट्नुहोस् ताकि नयाँ स्वस्थ वृद्धि होस्। नमी जोगाउन र झार नियन्त्रण गर्न मल्च प्रयोग गर्नुहोस्।

source: Soybean___healthy
ne: सोयाबिन___स्वस्थ

source: Soybeans need good drainage, proper spacing, and regular watering. Fertilize with nitrogen-rich compounds to support healthy growth. Rotate crops to avoid soil-borne diseases and improve soil fertility.
ne: सोयाबिनलाई राम्रो निकास, उचित दूरी, र नियमित पानी आवश्यक पर्छ। नाइट्रोजनयुक्त मल प्रयोग गर्नुहोस् ताकि राम्रो वृद्धि होस्। बाली फेरेर माटोको रोग घटाउनुहोस् र उर्वरता सुधार गर्नुहोस्।

source: Squash___Powdery_mildew
ne: स्क्वास___पाउडरी फफूंदी

source: Apply sulfur-based fungicides or neem oil to control powdery mildew. Remove infected leaves and ensure proper spacing for air circulation. Avoid overhead irrigation to prevent the spread of fungal spores.
ne: पाउडरी फफूंदी नियन्त्रण गर्न गन्धक-आधारित फफूंदी नाशक वा निमको तेल प्रयोग गर्नुहोस्। संक्रमित पातहरू हटाउनुहोस् र हावापासका लागि उचित दूरी राख्नुहोस्। फफूंदीको स्पोर्स फैलन नदिन माथिबाट पानी हाल्न नदिनुहोस्।

source: Strawberry___Leaf_scorch
ne: स्ट्रबेरी___पातको डढेलो

source: Remove affected leaves and apply copper-based fungicides. Water at the base of the plants and avoid wetting the foliage. Mulch around the plants to retain moisture and prevent weed growth.
ne: संक्रमित पातहरू हटाउनुहोस् र तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। बोटको आधारमा पानी हाल्नुहोस् र पात नभिज्ने प्रयास गर्नुहोस्। नमी जोगाउन र झार घटाउन बोट वरिपरि मल्च हाल्नुहोस्।

source: Strawberry___healthy
ne: स्ट्रबेरी___स्वस्थ

source: Ensure strawberries receive well-drained, slightly acidic soil. Mulch to retain moisture and prevent weed competition. Monitor plants for pests and diseases and ensure they receive full sunlight.
ne: स्ट्रबेरीलाई राम्रो निकास भएको अलिकति अम्लीय माटो आवश्यक हुन्छ। नमी जोगाउन र झार रोक्न मल्च प्रयोग गर्नुहोस्। कीरा तथा रोगहरूको निगरानी गर्नुहोस् र पर्याप्त घाम सुनिश्चित गर्नुहोस्।

source: Tomato___Bacterial_spot
ne: गोलभेंडा___ब्याक्टेरियल दाग

source: Remove infected plant material and apply bactericides like copper-based fungicides. Ensure good air circulation by spacing plants properly. Avoid overhead watering and rotate crops to prevent bacterial buildup.
ne: संक्रमित भागहरू हटाउनुहोस् र तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। बोटहरू बीचको दूरी ठीक राखेर हावापास सुनिश्चित गर्नुहोस्। माथिबाट पानी हाल्न नदिनुहोस् र बाली फेरेर ब्याक्टेरिया संकलन रोक्नुहोस्।

source: Tomato___Early_blight
ne: गोलभेंडा___पहिलो झुल

source: Apply fungicides like chlorothalonil and remove infected leaves. Ensure good spacing and avoid working in wet conditions to reduce fungal spread. Prune dead or diseased leaves to maintain plant health.
ne: क्लोरोथालोनिलजस्ता फफूंदी नाशक प्रयोग गर्नुहोस् र संक्रमित पातहरू हटाउनुहोस्। बोटहरूको दूरी सुनिश्चित गर्नुहोस् र भिजेको अवस्थामा काम नगर

source: Tomato___Late_blight
ne: गोलभेंडा___ढिलो झुल

source: Apply fungicides during wet weather and remove infected plants immediately. Rotate crops to reduce the spread of the disease and avoid over-wateringEnsure proper soil drainage and good air circulation around plants.
ne: ओसिलो मौसममा फफूंदी नाशक प्रयोग गर्नुहोस् र संक्रमित बोटहरू तुरुन्त हटाउनुहोस्। बाली फेर्नुहोस् र अत्यधिक पानी नदिनुहोस्। राम्रो माटो निकास र हावापास सुनिश्चित गर्नुहोस्।

source: Tomato___Leaf_Mold
ne: गोलभेंडा___पातको ढुसी

source: Prune plants to increase airflow and reduce humidity. Apply copper-based fungicides to control the infection. Remove infected leaves and avoid overhead watering.
ne: हावापास सुधार गर्न बोट काटछाँट गर्नुहोस् र आर्द्रता घटाउनुहोस्। तामाजन्य फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पातहरू हटाउनुहोस् र माथिबाट पानी हाल्न नदिनुहोस्।

source: Tomato___Septoria_leaf_spot
ne: गोलभेंडा___सेप्टोरिया पात दाग

source: Remove infected leaves and apply fungicides containing chlorothalonil or mancozeb. Ensure good spacing between plants to reduce humidity and promote airflow. Avoid working with wet plants and sanitize tools to prevent disease spread.
ne: संक्रमित पातहरू हटाउनुहोस् र क्लोरोथालोनिल वा म्यानकोजेब भएको फफूंदी नाशक प्रयोग गर्नुहोस्। बोटहरूको दूरी कायम गरेर हावापास बढाउनुहोस्। भिजेको बोटमा काम नगर्नुहोस् र उपकरणहरू सफा राख्नुहोस्।

source: Tomato___Spider_mites Two-spotted_spider_mite
ne: गोलभेंडा___माकुरो किरा (दुई थोप्लो माकुरो)

source: Use miticides like abamectin or neem oil to control spider mites. Regularly rinse plants with water to remove mites and their webs. Remove infected leaves and check for new signs of mite activity.
ne: स्पाइडर माइट नियन्त्रण गर्न अबामेक्टिन वा निमको तेलजस्ता माइटिसाइड प्रयोग गर्नुहोस्। नियमित रूपमा पानीले बोट धुने गर्नुहोस् ताकि माइट र त्यसका जाल हटाइयोस्।संक्रमित पातहरू हटाउनुहोस् र नयाँ संक्रमणको जाँच गर्नुहोस्।

source: Tomato___Target_Spot
ne: गोलभेंडा___टार्गेट स्पट

source: Apply fungicides containing mancozeb to control target spot. Remove infected leaves immediately and ensure proper plant spacing. Rotate crops and practice good soil management to reduce the disease.
ne: नियन्त्रण गर्न म्यानकोजेब भएको फफूंदी नाशक प्रयोग गर्नुहोस्। संक्रमित पातहरू तुरुन्त हटाउनुहोस् र बोटको दूरी कायम राख्नुहोस्। बाली फेर्नुहोस् र माटोको राम्रो व्यवस्थापन गर्नुहोस्।

source: Tomato___Tomato_Yellow_Leaf_Curl_Virus
ne: गोलभेंडा___गोलभेंडा पहेंलो पात कर्ल भाइरस

source: Remove infected plants and control aphid populations using insecticides. Sanitize tools and avoid using infected transplants. Maintain strict sanitation protocols to prevent further spread of the virus.
ne: संक्रमित बोटहरू हटाउनुहोस् र एफिडको संख्या घटाउन कीटनाशक प्रयोग गर्नुहोस्। उपकरणहरू सफा गर्नुहोस् र संक्रमित बिरुवा प्रयोग नगर्नुहोस्। थप फैलावट रोक्न कडाइका साथ सरसफाइ गर्नुहोस्।

source: Tomato___Tomato_mosaic_virus
ne: गोलभेंडा___गोलभेंडा मोजाइक भाइरस

source: Remove and destroy infected plants immediately to prevent spread. Control aphids, which spread the virus, by using insecticides.Sanitize tools and avoid using infected transplants.
ne: संक्रमित बोटहरू तुरुन्त हटाएर नष्ट गर्नुहोस्। यो भाइरस फैलाउने एफिडहरू नियन्त्रण गर्न कीटनाशक प्रयोग गर्नुहोस्। उपकरणहरू सफा गर्नुहोस् र संक्रमित बिरुवा प्रयोग नगर्नुहोस्।

source: Tomato___healthy
ne: गोलभेंडा___स्वस्थ

source: Provide regular watering and balanced fertilization for healthy tomato growth. Ensure adequate sunlight for photosynthesis and prune damaged leaves.Monitor for pests and remove infected parts to prevent further damage.
ne: नियमित रूपमा पानी दिनुहोस् र सन्तुलित मल प्रयोग गर्नुहोस्। पर्याप्त घाम सुनिश्चित गर्नुहोस् रबिग्रिएका पातहरू काट्नुहोस्। कीरा तथा रोगहरूको निगरानी गर्नुहोस् र संक्रमित भागहरू हटाउनुहोस्।

source: not_a_leaf
ne: पात होइन

source: Excellent
ne: उत्कृष्ट

source: Expected to produce maximum yield
ne: अधिकतम उत्पादन हुने अपेक्षा

source: Good
ne: राम्रो

source: Expected to produce good yield
ne: राम्रो उत्पादन हुने अपेक्षा

source: Average
ne: औसत

source: Expected to produce average yield
ne: औसत उत्पादन हुने अपेक्षा

source: Below Average
ne: औसतभन्दा कम

source: Expected to produce below average yield
ne: औसतभन्दा कम उत्पादन हुने अपेक्षा

source: Poor
ne: कमजोर

source: Expected to produce poor yield
ne: कमजोर उत्पादन हुने अपेक्षा
